<?php


// 00系：系统级错误 - 外部或第三方接口相关
$lang['error_00001'] = '其它错误（具体请见 msg 内容）';
$lang['error_00011'] = '云端接口访问异常';
$lang['error_00012'] = '云端接口访问超时';
$lang['error_00013'] = '云端接口访问受限';

// 01系：系统级错误 - 本系统相关
$lang['error_01001'] = '接口请求异常';
$lang['error_01002'] = '参数传递不合法';
$lang['error_01003'] = '请求超时';
$lang['error_01004'] = '必要参数不能为空';
$lang['error_01005'] = '数据创建失败';
$lang['error_01006'] = '输入参数不能小于1字节';
$lang['error_01007'] = '请求签名过期';
$lang['error_01008'] = '请求签名不正确';
$lang['error_01009'] = '未检测到有效签名的非法请求';

// 021系：业务级错误 - 平台相关 - 用户
$lang['error_02101'] = '该用户不存在';
$lang['error_02102'] = '用户ID不能为空';

// 022系：业务级错误 - 平台相关 - 交易
$lang['error_02201'] = '该订单不存在';
$lang['error_02202'] = '订单创建失败';

// 031系：业务级错误 - 房子相关 - 楼盘
$lang['error_03101'] = '该楼盘不存在';
$lang['error_03102'] = '楼盘ID不能为空';

// 032系：业务级错误 - 房子相关 - 户型
$lang['error_03201'] = '该户型不存在';
$lang['error_03202'] = '户型ID不能为空';

// 033系：业务级错误 - 房子相关 - 房源
$lang['error_03301'] = '该房源不存在';
$lang['error_03302'] = '房源ID不能为空';


//051系：业务级错误 - 楼盘相关
$lang['error_05104'] = '优惠验证码未生成';
// notice
// 9xxx... 9开头的错误消息后面的为错误码透传
