<?php
/**
 * Created by PhpStorm.
 * User: yaohaochen
 * Date: 16/5/20
 * Time: 13:07
 */

// 上海
$config['place_types'] = [
    [
        'id' => '1',
        'name' => '幼儿园'
    ],
    [
        'id' => '2',
        'name' => '小学'
    ],
    [
        'id' => '3',
        'name' => '中学'
    ],
    [
        'id' => '4',
        'name' => '超市'
    ],
    [
        'id' => '5',
        'name' => '医院'
    ],
    [
        'id' => '6',
        'name' => '地名'
    ],
    [
        'id' => '7',
        'name' => '大学'
    ],
    [
        'id' => '8',
        'name' => '行政机关'
    ],
    [
        'id' => '9',
        'name' => '公园'
    ],
    [
        'id' => '10',
        'name' => '场馆'
    ],
    [
        'id' => '11',
        'name' => '职业教育'
    ],
    [
        'id' => '12',
        'name' => '旅游景点'
    ],

    [
        'id' => '14',
        'name' => '汽车站'
    ],
    [
        'id' => '15',
        'name' => '诊所'
    ],
    [
        'id' => '16',
        'name' => '商业街'
    ],
    [
        'id' => '18',
        'name' => '码头'
    ],
    [
        'id' => '20',
        'name' => '火车站'
    ],
    [
        'id' => '23',
        'name' => '机场码头'
    ],
    [
        'id' => '25',
        'name' => '娱乐广场'
    ],
    [
        'id' => '22',
        'name' => '游乐场'
    ],
    [
        'id' => '17',
        'name' => '广场'
    ],

];