<?php
/**
 * Created by PhpStorm.
 * User: yaohaochen
 * Date: 16/5/20
 * Time: 13:07
 */

$config['esf_menu_head'] = [
    [
        'name' => '200万超值新房',
        'redirect_url' => ''
    ],
    [
        'name' => '精装小户型',
        'redirect_url' => ''
    ],
    [
        'name' => '最近新上房源',
        'redirect_url' => ''
    ]
];

$config['esf_menu_right_ad'] = [
    'house_price' => [],
    'school' => [],
    'metro' => []
];


$config['hot_word'] = [
    'section' => [
        '121' => ['浦东', '宝山', '闵行', '普陀', '松江'],
        '1337' => ['南山', '龙岗', '福田', '宝安', '罗湖'],
        '267' => ['江宁', '鼓楼', '秦淮', '浦口', '玄武'],
        '2316' => ['余杭', '江干区', '西湖区', '下城区', '萧山'],
        '3' => ['园区', '姑苏', '吴中', '新区', '相城'],
        '852' => ['番禺', '天河', '白云', '海珠', '越秀']
    ],
    'price' => [
        '121' => ['500万以上', '300-400万'],
        '1337' => ['500万以上', '200-300万'],
        '267' => ['100-150万', '100万以下'],
        '2316' => ['100-150万', '100万以下'],
        '3' => ['200-300万', '150-200万'],
        '852' => ['100万以下', '100-150万']
    ],
    'room' => [
        '121' => ['二室'],
        '1337' => ['二室'],
        '267' => ['二室'],
        '2316' => ['三室'],
        '3' => ['三室'],
        '852' => ['二室']
    ],
    'school_section' => [
        '121' => ['浦东', '徐汇', '静安', '长宁'],
        '1337' => ['南山', '罗湖', '福田', '宝安'],
        '267' => ['江宁', '鼓楼', '秦淮', '玄武'],
        '2316' => ['江干区', '西湖区', '上城区', '拱墅区'],
        '3' => ['园区', '姑苏', '吴中', '新区'],
        '852' => ['黄埔', '天河', '白云', '越秀']
    ],
    'school' => [
        '121' => ['上海市浦东新区明珠小学', '上海市闸北区第一中心小学', '上海市杨浦区杨浦小学', '上海市长宁实验小学', '上海市黄浦区蓬莱路第二小学'],
        '1337' => ['深圳实验学校小学部', '深圳市百花小学', '园岭小学', '荔园小学', '深圳市福田区莲花小学'],
        '267' => ['琅琊路小学', '拉萨路小学', '力学小学', '南京市芳草园小学', '北京东路小学'],
        '2316' => ['学军小学求智校区', '学军小学紫金港校区', '文一街小学文一校区', '行知小学', '文三街小学'],
        '3' => ['苏州市实验小学', '苏州市星海小学', '苏州市平直实验小学', '苏州市枫桥中心小学', '苏州市狮山实验小学'],
        '852' => ['朝天小学', '协和小学', '东风西路小学(西校区)', '怡园小学西校区', '市桥中心小学']
    ],
    'tags' => ['上门实勘', '满五唯一'],
    'metro_line' => [
        '121' => ['4号线', '7号线', '6号线', '3号线'],
        '1337' => ['3号线', '1号线', '2号线'],
        '267' => ['1号线', '3号线', '2号线'],
        '2316' => ['1号线主线	', '4号线'],
        '3' => ['1号线'],
        '852' => ['2号线', '1号线', '6号线']
    ],
];

$config['tags'] = [
    [
        'name' => '上门实勘',
        'targetUrl' => auto_url('/web/sale/all?tag=上门实勘')
    ],
    [
        'name' => '满两年',
        'targetUrl' => auto_url('/web/sale/all?tag=满两年')
    ],
    [
        'name' => '满五唯一',
        'targetUrl' => auto_url('/web/sale/all?tag=满五唯一')
    ],
    [
        'name' => '无贷款',
        'targetUrl' => auto_url('/web/sale/all?tag=无贷款')
    ],
    [
        'name' => '电梯房',
        'targetUrl' => auto_url('/web/sale/all?tag=电梯房')
    ],
    [
        'name' => '地铁房',
        'targetUrl' => auto_url('/web/sale/all?tag=地铁房')
    ],
    [
        'name' => '学区房',
        'targetUrl' => auto_url('/web/sale/all?tag=学区房')
    ],
    [
        'name' => '南北通透',
        'targetUrl' => auto_url('/web/sale/all?tag=南北通透')
    ],
    [
        'name' => '产证已验',
        'targetUrl' => auto_url('/web/sale/all?tag=产证已验')
    ]
];
